bryamzxz/tinylink/sdkconfig.defaults
# SPDX-License-Identifier: MIT
# Copyright (c) 2026 Bryam (bryamzxz)
#
# tinylink default sdkconfig — common to all ESP32 variants.
# Per-target overrides live in sdkconfig.defaults.<target>.
#
# Hardening + tuning baseline for ESP-IDF v5.5.x.

# ---- Target / flash / partition table ----------------------------------------
# partitions.csv places ota_1 at 0x320000 + a 0x4000 nvs_creds region, so flash
# must be ≥ 4 MB (ESP32-WROOM-32E and friends ship with 4 MB).
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
# QIO@80MHz is within the WROOM-32E datasheet Table 17 spec
# ("FC Maximum clock frequency = 80 MHz, guaranteed through design
# and/or characterization") — the integrated flash + module layout
# are pre-characterized by Espressif for this configuration, so no
# soak test is required for this specific module.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---- WiFi tuning (single-STA, low memory) ------------------------------------
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y
# WiFi mgmt buffer pool — IDF default is 32, sized for clients that
# scan + roam across multiple APs (each scan response/beacon/probe
# response burst needs a free buffer). Tinylink associates to ONE
# fixed AP (INTELCOM-CARDONA), never roams, doesn't scan post-assoc.
# 8 buffers cover the worst-case probe-response burst during the
# initial scan + leave headroom for unsolicited beacons / deauth
# frames the supplicant still has to process. ~700 B per buffer,
# 32 -> 8 saves ~16-17 KiB DRAM static. Failure mode if too small:
# WiFi disconnect-retry loop visible immediately in serial logs.
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=8
# Station-only build: tinylink never runs as an AP (no WIFI_MODE_AP,
# no esp_wifi_set_mode(WIFI_MODE_AP), no softap_start call site).
# Drops the entire AP-side code path: beacon scheduler, AID table,
# DTIM management on AP side, AP-side WPS handshake, AP-side WPA
# supplicant fragment.
# CONFIG_ESP_WIFI_SOFTAP_SUPPORT is not set
# WPA3-Personal (SAE) handshake codepath: not needed; the production
# AP (INTELCOM-CARDONA) is WPA2-PSK-SHA256 + PMF, not WPA3-Personal.
# Removes SAE-PWE Dragonfly + SAE-H2E variants.
# CONFIG_ESP_WIFI_ENABLE_WPA3_SAE is not set
# WPA3-OWE-STA (Opportunistic Wireless Encryption for open networks).
# tinylink never associates to open APs; the production AP is WPA2.
# CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA is not set

# ---- Power management --------------------------------------------------------
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# main.c::configure_pm() (called AFTER WiFi associates) sets
# light_sleep_enable=true, max=240, min=80. That call is what unlocks
# PM_MODE_LIGHT_SLEEP in pm_impl.c:561 — without it, tickless idle never
# enters light sleep at all.
#
# ESP_WIFI_SLP_IRAM_OPT and ESP_WIFI_SLP_BEACON_LOST_OPT are documented
# as the "always-on station" pair, but with WPA2-PSK + PMF on
# INTELCOM-CARDONA they break initial association — the AP kicks the
# client between AUTH-ASSOC handshake and DHCP. Verified empirically:
# enabling SLP_IRAM_OPT alone (which auto-selects PM_SLP_DEFAULT_PARAMS_OPT)
# is enough to reproduce the disconnect-retry-loop seen in the previous
# perf round. Stay disabled until we have an A/B against a less PMF-strict
# AP, or until IDF documents the actual interaction.

# ---- mbedTLS minimal config (TLS + crypto for ts2021/DERP) -------------------
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
# Heap budget for two simultaneous TLS conns (long-poll + DERP
# supervisor). Pinning rationale, item-by-item:
#
# 1. DYNAMIC_BUFFER=y + SESSION_TICKETS=n. Verified on-device 2026-05-06.
#
# History: PR #20 (512f772) experimented with DYNAMIC_BUFFER=y and a
# 2026-05-02 incident reported mid-write heap corruption, after which
# the flag was reverted. The followup notes attributed it ambiguously
# to either DYNAMIC_BUFFER itself or the (DYNAMIC_BUFFER + tickets)
# combination plus IDF bug PR #14614 / IDFGH-13752 (heap corruption
# when DYNAMIC_BUFFER + IN_CONTENT_LEN<16384) and #15984 (TLS 1.3
# panics with DYNAMIC_BUFFER on).
#
# This sprint isolated the variables: DYNAMIC_BUFFER=y with
# SESSION_TICKETS=n through 5+ minutes of steady-state long-poll
# (full handshake on every reconnect, no ticket resumption) plus
# 70+ telemetry tx in a row, zero corruption, zero alloc fails,
# zero stream ends. IN_CONTENT_LEN stays at 16384 so #14614 does
# not apply. #15984 was historically a TLS 1.3 panic on connect;
# our tinylink-→Tailscale TLS path negotiates 1.3 and connects
# cleanly here, so either the IDF fix landed in v5.5.4 or our
# ciphersuite/extension set sidesteps the trigger.
#
# Heap effect: at supervisor-connect time (post-bringup, post-WG)
# largest_block went from 7.4 KiB → 11.8 KiB (+4.4 KiB). Still
# below the 12 KiB peak mbedtls cert verify needs for the second
# TLS conn, so SUPERVISED=y still doesn't connect on first try
# without further work — that's a separate PR (supervisor task
# restructure to retry until heap allows).
#
# Trade-off vs SESSION_TICKETS=y: each long-poll reconnect now does
# a full TLS handshake (cert chain verify, RSA signature) instead
# of resuming via NewSessionTicket. ~10 KiB transient peak instead
# of ~4 KiB transient peak. Acceptable because the steady-state
# heap budget freed by DYNAMIC_BUFFER=y outweighs the per-reconnect
# cost on this ESP32-WROOM-32E target.
#
# 2. IN_CONTENT_LEN stays at 16384. Go's crypto/tls (what
#    controlplane.tailscale.com runs) emits TLS records up to 16384
#    plaintext regardless of the application layer's frame sizes.
#    Lowering IN below 16384 would surface as record_overflow alerts
#    on a large keepalive or the first MapResponse. Also keeps us
#    out of IDF bug PR #14614 / IDFGH-13752 (heap corruption when
#    DYNAMIC_BUFFER + IN_CONTENT_LEN<16384).
# 3. OUT_CONTENT_LEN at 2048 (down from 4096). tinylink emits short
#    frames in both directions: MapRequest ~500 B-2 KiB, DERP
#    frames <1500 B WG packets. Saves 2 KiB per conn × 2 conns.
# 4. KEEP_PEER_CERTIFICATE off. Saves ~2 KiB per conn; we don't
#    introspect certs after verify.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=n
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=n
# Tinylink never calls mbedtls_strerror() — error reporting goes through
# ESP_LOG with the hex error code only. Dropping the string lookup saves
# the ~8 KiB table that maps each MBEDTLS_ERR_* enum to its human name.
# Field-debug an mbedtls error by grepping include/mbedtls/error.h with
# the printed hex value.
# CONFIG_MBEDTLS_ERROR_STRINGS is not set

# ---- mbedTLS ECP curves — trim to {P-256, P-384, Curve25519} ----------------
# Tailscale's controlplane.tailscale.com is currently fronted by Let's
# Encrypt's E8 intermediate. Verified 2026-05-12 via
#   openssl s_client -connect controlplane.tailscale.com:443 \
#     -servername controlplane.tailscale.com -showcerts
#
# Leaf cert:  public key = P-256 (prime256v1),
#             signed with ecdsa-with-SHA384 by issuer "Let's Encrypt E8"
# Issuer E8:  public key = P-384 (secp384r1),
#             signed with ecdsa-with-SHA384 by ISRG Root X2 (also P-384)
#
# So we MUST keep P-256 (leaf key) AND P-384 (intermediate + root key) to
# validate the chain. Hash side is covered by CONFIG_MBEDTLS_SHA512_C=y
# (provides SHA-384). DERP TLS endpoints (derp1.tailscale.com etc.) sit
# behind the same LE E8 issuer chain, so this set serves both.
#
# Initial attempt on this branch trimmed P-384 too, which broke the
# handshake with mbedtls_ssl_handshake = -0x3A00 (X509_CERT_VERIFY_FAILED)
# against BOTH controlplane and derp1 — fail-loud at boot, no silent
# regression. P-384 stays on. Re-audit if Tailscale ever rotates to a
# different LE chain (E5/E6 are P-256, but the upstream root behind those
# is still P-384 ISRG X2 today).
#
# Curve25519 stays on too — costs ~78 B (ecp_mod_p255) and a few tables,
# keeps mbedTLS's X25519 KEM path warm for any future TLS 1.3 enablement
# (currently MBEDTLS_SSL_PROTO_TLS1_3 is off, so this is a hedge). Noise
# IK + WireGuard use the vendored donna X25519 in crypto/curve25519*.c
# independently of this Kconfig.
#
# Dropped curves (8): SECP192R1, SECP224R1, SECP521R1, the three Koblitz
# (SECP192K1, SECP224K1, SECP256K1), and the three Brainpool (BP256R1,
# BP384R1, BP512R1). Confirmed pre-trim via xtensa-esp32-elf-nm that
# these consumed `ecp_mod_p<bits>` helpers (~78-610 B each) plus per-
# curve `<curve>_p/_n/_gx/_gy/_b/_a` rodata tables (48-68 B × 6 per
# curve) ≈ 5-7 KiB across all eight.
# CONFIG_MBEDTLS_ECP_DP_SECP192R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP224R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP521R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP192K1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP224K1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP256R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP384R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP512R1_ENABLED is not set

# ---- mbedTLS — final prune: CCM, PKCS7, non-AES GCM, deterministic ECDSA ----
# Final stage of the perf-audit mbedTLS section (stages 1-3 trimmed
# curves, static-ECDH, and X.509 CRL/CSR). This batch turns off four
# more sub-systems that grep confirms tinylink and its dependencies
# never call.
#
# 1. CCM_C — AES-CCM mode (counter with CBC-MAC, RFC 3610). Used by
#    some IoT-class TLS suites (TLS_*_WITH_AES_*_CCM_8 etc.) and by
#    DTLS deployments that want a lighter alternative to GCM. Modern
#    Go crypto/tls (controlplane + DERP) advertises ONLY GCM and
#    ChaCha20-Poly1305 — no CCM in the suite list. Verified empirically
#    on this branch's parent: the negotiated suite is consistently
#    ECDHE-RSA-AES128-GCM-SHA256. ChaCha20-Poly1305 stays available
#    via MBEDTLS_CHACHAPOLY_C (separate Kconfig, kept on as a fallback
#    if the server ever rotates suite preferences).
#
# 2. PKCS7_C — Cryptographic Message Syntax (PKCS#7 / RFC 2315) parser.
#    Used for S/MIME, code-signing envelopes, etc. The IDF bootloader's
#    secure-boot signature path uses ECDSA over the partition table +
#    app image, NOT PKCS#7. The tinylink TLS path uses raw X.509 certs,
#    not PKCS#7-wrapped chains. Grep: no `mbedtls_pkcs7_` calls
#    anywhere in components/tinylink/src or main/.
#
# 3. GCM_SUPPORT_NON_AES_CIPHER — gates ARIA-GCM + Camellia-GCM. Both
#    are Korean/Japanese alternatives to AES that nobody on the public
#    internet uses for TLS. xtensa-esp32-elf-nm on the pre-trim ELF
#    shows the ARIA implementation present:
#      mbedtls_aria_setkey_enc  (883 B .text)
#      mbedtls_aria_crypt_ecb   (814 B .text)
#      aria_sb1/sb2/is1/is2     (256 B each rodata, 1024 B total)
#      mbedtls_aria_crypt_cbc / _cfb128 / setkey_dec
#    plus the ARIA-specific GCM wrapper. Disabling this Kconfig
#    de-selects MBEDTLS_ARIA_C and MBEDTLS_CAMELLIA_C transitively
#    in the IDF Kconfig graph, stripping the full block.
#
# 4. ECDSA_DETERMINISTIC — RFC 6979 deterministic-nonce ECDSA SIGNING.
#    Tinylink only VERIFIES ECDSA signatures (the Tailscale cert chain
#    + the optional control-key TOFU pin). Verification uses
#    mbedtls_ecdsa_verify, which doesn't depend on nonce generation at
#    all — the signature already carries the (r, s) pair. The
#    deterministic-sign API + its HMAC_DRBG backing (~600 B
#    mbedtls_hmac_drbg_*) are pure dead weight here.
#
# What stays enabled:
#   MBEDTLS_GCM_C=y            (AES-GCM, the suite Tailscale uses)
#   MBEDTLS_CHACHAPOLY_C=y     (ChaCha20-Poly1305 TLS fallback +
#                               independently used by ts2021/WG via
#                               the vendored donna implementations)
#   MBEDTLS_ECDSA_C=y          (verify-only path)
#   MBEDTLS_X509_CRT_PARSE_C=y (still load-bearing for cert chain)
#
# Expected symbol drop: full ARIA (~3-4 KiB), CCM mode functions
# (~1-1.5 KiB), HMAC_DRBG (~600-800 B), deterministic-ECDSA signing
# helpers (~200 B). All four batched into one PR because they have
# zero coupling to each other; each one's verify-path effect is
# independently grep-verified above.
# CONFIG_MBEDTLS_CCM_C is not set
# CONFIG_MBEDTLS_PKCS7_C is not set
# CONFIG_MBEDTLS_GCM_SUPPORT_NON_AES_CIPHER is not set
# CONFIG_MBEDTLS_ECDSA_DETERMINISTIC is not set

