bryamzxz/tinylink/sdkconfig.defaults
# ---- FreeRTOS ----------------------------------------------------------------
# HZ=100 (10 ms tick granularity) reduces tick-ISR overhead vs the IDF
# default 1000 (1 ms ticks) and lets tickless idle skip larger blocks
# at once. Audited 2026-05-10: every pdMS_TO_TICKS(N) callsite in tinylink
# uses N >= 100 ms, so no delay round-trips to 0 ticks. No bare integer
# tick arguments to vTaskDelay / xQueue* / xSemaphoreTake in our code.
CONFIG_FREERTOS_HZ=100
# Pin timer service task to CPU0 along with tcpip + WiFi MAC. IDF
# default is NO_AFFINITY; cache-locality argument identical to the
# lwIP tcpip pin above. Cheap, no measurable downside on a low-load
# device.
CONFIG_FREERTOS_TIMER_TASK_AFFINITY_CPU0=y

# ---- lwIP tcpip_thread stack — bump from IDF default 3 KiB ------------------
# 30-min soak 2026-05-13 caught a stack overflow in the `tiT` task
# (the lwIP tcpip_thread) under heap-pressure conditions: Servidor1's
# WG responder was unreachable for several minutes, ESP32-side
# handshake retries piled up, telemetry sendto started returning ENOMEM
# (errno=12) on the UDP socket — lwIP's error-recovery path in tcpip_
# input/tcpip_callback used more stack than the happy path, and at the
# default 3 KiB allocation `tiT` was already at 95.5 % steady-state
# (`hwm = 140 B free` consistent across the soak's diag dumps).
# Result: explicit FreeRTOS stack-overflow canary fire + reset.
#
#   Panic signature:  ***ERROR*** A stack overflow in task tiT has
#                     been detected.
#   Steady-state peak: 2 932 B used out of 3 072 alloc
#   Crash scenario:   deeper code path under ENOMEM / heap-fragment-
#                     ation conditions, exact peak unknown but > 3 072 B
#
# 4 608 B (4.5 KiB) gives 1 676 B margin (57 %) over the observed
# steady-state peak. That's the cushion size adopted as a baseline for
# the stack trims in this round; same target works in reverse for
# bumping a too-tight stack. Cost: ~1.5 KiB more heap at lwIP init —
# acceptable trade vs the device-resets-itself-in-the-field failure
# mode.
#
# Not bumping to 5 KiB or 6 KiB because the underlying cause (heap
# pressure from extended WG-responder-unreachable cascade) is fixable
# upstream — once Servidor1 stays reachable, the deep path doesn't fire.
# 4.5 KiB is sized for the rare residual scenario where Servidor1 burps
# briefly.
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4608
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# ---- IRAM-to-flash placement (production trim) -------------------------------
# ESP32-WROOM-32E has only 128 KiB IRAM total; the post-η firmware was
# at 80% IRAM (104 KiB used, 27 KiB free). These three knobs move
# never-from-ISR code paths out of IRAM and into flash-XIP. Real-time
# behaviour is unchanged because none of these functions are reachable
# while flash is suspended (auto-suspend disabled in tinylink) or from
# cache-disabled ISRs (we have no such ISR). Documented cost: WiFi
# RX throughput drops a few percent because every RX packet now incurs
# a flash cache miss on its first call. Tinylink's load (1 Hz
# telemetry + ~6/min long-poll inbound + WG handshake every ~85 s) is
# 3 orders of magnitude below the WiFi ceiling, so the throughput
# hit is invisible.

# WiFi RX path: the biggest single IRAM mover (~15 KiB).
# CONFIG_ESP_WIFI_RX_IRAM_OPT is not set
# FreeRTOS scheduler hot path: moves vTaskSwitchContext / xQueue*
# helpers / xSemaphore* into flash. Safe because we never call them
# from a cache-disabled ISR.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
# RingBuffer helpers: tinylink doesn't have an ISR producer/consumer
# for any RingBuffer.
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
# newlib lock helpers (`__retarget_lock_*`): only need to be in IRAM
# if newlib state is mutated from a cache-disabled ISR, which tinylink
# does not do (no SPI_FLASH_AUTO_SUSPEND, no IRAM_ATTR newlib touch).
# CONFIG_LIBC_LOCKS_PLACE_IN_IRAM is not set

# ---- TLS to control plane ----------------------------------------------------
# tinylink talks ts2021 over TLS to controlplane.tailscale.com. We use
# esp_tls on top of mbedtls and verify against the IDF certificate bundle.
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_ESP_TLS_USE_SECURE_ELEMENT=n
CONFIG_ESP_TLS_INSECURE=n
CONFIG_MBEDTLS_POLY1305_C=y

# ---- App task stacks ---------------------------------------------------------
# Bigger main stack: TLS + Noise IK + JSON construction is much heavier than
# the M1-WG bringup that this replaces. Verified on-device 2026-05-02:
# the boot-time mbedtls cert-chain verification + ECDSA + Noise IK init
# in tinylink_register peaks at ~14 KiB; bumped from 16 K to 24 K to give
# margin. The long-poll task in tinylink.c::tinylink_long_poll_start
# also xTaskCreate's at 24 KiB to absorb the same workload — bug from
# 8 K manifested as random LoadProhibited / Double exception / fake
# heap-corruption asserts.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=24576

# esp_timer dispatch task stack. mbedtls / lwIP timer callbacks (e.g.
# session ticket lifetime, sntp, peer-cert cleanup) routed through here
# blow past the 3584-byte default once TLS to controlplane.tailscale.com
# is up. Observed on first HW boot 2026-05-02: panic with EXCCAUSE 0x1c
# (LoadStoreError) immediately after the control-key fetch path,
# classic stack-overflow corruption. 6144 gives ~2x headroom.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

# ---- Production: silent error paths ------------------------------------------
# newlib-nano printf/scanf — drops %lld/%llu/%lf support, recovers the
# big chunk of flash that _vfprintf_r / _svfprintf_r / __ssvfscanf_r
# carry (measured ~11 KiB / 11 KiB / 8.6 KiB pre-trim in the post-curves
# ELF, plus _strtod_l + _dtoa_r at ~3 KiB each). Enabled together with
# the conversion of all 11 %lld/%llu call-sites in this branch to
# either (unsigned long)+%lu (for bounded counters) or 32-bit hex high/
# low split (for genuine 64-bit values: TAI64N timestamps, Tailscale
# node ID). %f / %g also unsupported under nano — tinylink never logs
# floats (telemetry prints temp as %ld.%03ld manually), so safe.
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y
# Asserts still abort (level=1) but don't print the message string + __FILE__
# + __LINE__. Same crash safety, ~10 KiB flash saved across the error-handling
# surface. Re-enable (=2) in a "diag" overlay if field-debugging a panic.
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
# ESP_RETURN_ON_ERROR / ESP_GOTO_ON_ERROR drop their format-string parameter
# when CHECKS_SILENT=y. The check still triggers the goto/return; only the
# log line on error is elided.
CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT=y
# Drops the ~7 KiB esp_err_msg_table[] rodata; esp_err_to_name() returns
# "UNKNOWN ERROR" plus the hex code. Operationally readable, just lookup-free.
# CONFIG_ESP_ERR_TO_NAME_LOOKUP is not set
